src/InformationRegisters/Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат/Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат</name>
  <resources>
    <name>ДоступностьДилеру</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Производство</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Надстройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Логистика</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отгрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>КлючеваяДата</name>
    <type>
      <types>EnumRef.Scan_КлючевыеДаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат/ManagerModule.bsl
//rarus BProg_Dekin 30.10.2019 0014452 +-
#Область Интерфейс

// Функция записи параметров в регистр сведений
// Параметры:
//  ВидКлючевойДаты - ПеречислениеСсылка.Scan_КлючевыеДаты – вид ключевой даты
//	ЗначенияРесурсов - Строка табличной части, структура и т.д - Коллекция, к значениям которой можно обратиться через точку
// Возвращаемое значение:
//   Булево   – ошибка записи значения
Функция ЗаписьЗначенияРегистраСведения(ВидКлючевойДаты, ЗначенияРесурсов) Экспорт
	
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(ВидКлючевойДаты) Тогда
		Отказ = Истина;
		Возврат Отказ;
	КонецЕсли;
		
	МенеджерЗаписи = РегистрыСведений.Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.КлючеваяДата	  		= ВидКлючевойДаты;
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ЗначенияРесурсов);
	
	Попытка
		МенеджерЗаписи.Записать();  
	Исключение
		Сообщить(ОписаниеОшибки());
		Отказ = Истина;
	КонецПопытки; 
		
	Возврат Отказ;
КонецФункции

// Функция - Получить нстройки
//
// Параметры:
//  ОбъектКлючевыхДат	 - ПеречислениеСсылка.Scan_ОбъектыКлючевыхДат - 
// 
// Возвращаемое значение:
// ТаблицаЗначений  - Таблица в строках которой указаны настройки для ключевых дат. 
//
Функция ПолучитьНастройки(ОбъектКлючевыхДат) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗначениеПоУмолчанию", 	ЗначениеНастройкиПоУмолчанию());
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_КлючевыеДаты.Ссылка КАК КлючеваяДата,
	               |	ЕСТЬNULL(Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат.ДоступностьДилеру, &ЗначениеПоУмолчанию) КАК ДоступностьДилеру,
	               |	ЕСТЬNULL(Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат.Производство, &ЗначениеПоУмолчанию) КАК Производство,
	               |	ЕСТЬNULL(Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат.Надстройка, &ЗначениеПоУмолчанию) КАК Надстройка,
	               |	ЕСТЬNULL(Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат.Логистика, &ЗначениеПоУмолчанию) КАК Логистика,
	               |	ЕСТЬNULL(Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат.Отгрузка, &ЗначениеПоУмолчанию) КАК Отгрузка
	               |ИЗ
	               |	Перечисление.Scan_КлючевыеДаты КАК Scan_КлючевыеДаты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат КАК Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат
	               |		ПО Scan_КлючевыеДаты.Ссылка = Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат.КлючеваяДата";
	Настройки = Запрос.Выполнить().Выгрузить();
	Возврат Настройки;
КонецФункции

#КонецОбласти 

#Область Служебные

Функция	ЗначениеНастройкиПоУмолчанию()
	Возврат Истина;	
КонецФункции

#КонецОбласти
